module.exports = {
  START: true, // Запускать приложение?
  linked: true, // Генерировать ссылку приглашение при запуске?
  glitch: true, // Бот на Glitch.com ?
  clanPrice: 20000, // Цена создания клана.
  workInterval: 10, // Кулдаун работы в минутах.
  bonusInterval: 720, // Кулдаун бонуса в минутах.
  bonus: 500, // Количество монеток за бонус.
  VoiceOnline: {
    Coins: 5, // Сколько давать монеток за определённое время.
    Time: 1000 * 60 // Каждые столько-то миллисекунд будет выдаваться монетки.
  },
  Coins: {
    Value: "🍌",
    Format: {
      1: "банан", // Один.
      2: "банана", // Два.
      3: "бананов" // Пять и более.
    }
  },
  Status: {
    Url: "https://www.twitch.tv/kimchenliin", // URL стрима.
    Status: "online",
    /*
    {0} - серверов.
    {1} - участников.
    */
    Games: [
      { name: "!help", type: "STREAMING" },
      { name: "{0}.", type: "STREAMING" },
      { name: "{1}.", type: "STREAMING" },
      { name: "bongacams", type: "STREAMING" }
    ],
    Interval: 15000 // Через сколько миллисекунд менять статус.
  },
  owners: ["517331770656686080", "444742701112623115"], // Создатели бота.
  prefix: "!", // Префикс бота.
  activetoken: "AIzaSyDXKTTy2WKyKT5CzqPZcb1IVLBtk-mtQFE",
  OFFGUILD: "https://discord.gg/bndPq5u",
  colors: {
    GREEN: "008000",
    BLACK: "000000",
    WHITE: "FFFFFF",
    YELLOW: "FFFF00",
    AQUAMARINE: "#7FFFD4"
  },
  works: [
    { name: "Безработный", coins: 1, xp: 0 },
    { name: "Сборщик бутылок", coins: 10, xp: 10 },
    { name: "Попрошайка", coins: 250, xp: 25 },
    { name: "Вор голубиной еды", coins: 500, xp: 50 },
    { name: "Певец в метро", coins: 1200, xp: 95 },
    { name: "Клоун", coins: 2100, xp: 150 },
    { name: "Аниматор на детских праздниках", coins: 4000, xp: 230 },
    { name: "Работник заправки", coins: 5600, xp: 280 },
    { name: "Охранник в пятерочке", coins: 8000, xp: 360 },
    { name: "Промоутер", coins: 9500, xp: 400 },
    { name: "Водитель автобуса", coins: 12500, xp: 460 },
    { name: "Домохозяйка", coins: 14350, xp: 520 },
    { name: "Таксист", coins: 18750, xp: 615 },
    { name: "Грузчик", coins: 25252, xp: 712 },
    { name: "Менеджер по продажам", coins: 29000, xp: 830 },
    { name: "Хозяин ларька", coins: 35200, xp: 990 },
    { name: "Пилот", coins: 41000, xp: 1090 },
    { name: "Фрилансер", coins: 45200, xp: 1210 },
    { name: "Секретарь", coins: 52150, xp: 1337 },
    { name: "Владелец небольшой компании", coins: 61390, xp: 1500 },
    { name: "Сборщик налогов", coins: 73240, xp: 1638 },
    { name: "Менеджер завода по производству машин", coins: 94100, xp: 1845 },
    { name: "Водитель бизнесс класса", coins: 108000, xp: 2004 },
    { name: "Мэр города", coins: 131900, xp: 2410 },
    { name: "Депутат", coins: 159100, xp: 2900 },
    { name: "Президент", coins: 218000, xp: 3250 },
    { name: "Лиинчик", coins: 1, xp: 10000 }
  ],
  Marks: {
    "🔰": {
      name: "Новичок",
      description: "Начать пользоваться ботом"
    },
    "🐵": {
      name: "Обезьяна",
      description: "Заработать первую 1.000 бананов"
    },
    "💵": {
      name: "Rich day",
      description: "Заработать 100.000 бананов"
    },
    "🍌": {
      name: "Банановый магнат",
      description: "Заработать 50.000.000 бананов"
    },
    "📘": {
      name: "Ученик",
      description: "Получить 5 уровень"
    },
    "👨‍🎓": {
      name: "Студент",
      description: "Получить 25 уровень"
    },
    "👨‍🔬": {
      name: "Ученый",
      description: "Получить 100 уровень"
    },
    "🤖": {
      name: "Нейросеть",
      description: "Получить 499 уровень"
    },
    "🤡": {
      name: "Дени$ка",
      description: "Получить 1001 уровень"
    },
    "🔨": {
      name: "Злодей",
      description: "Забанить пользователя"
    },
    "📈": {
      name: "Ого!",
      description: "Получить бонус"
    },
    "🆘": {
      name: "Тестер",
      description: "Отправить баг в службу поддержки"
    },
    "💍": {
      name: "Поднял бабла!",
      description: "Выиграть 100.000 в казино"
    },
    "👑": {
      name: "Ограбил казино",
      description: "Выиграть 5.000.000 в казино"
    },
    "👨‍💼": {
      name: "Везунчик",
      description: "Выиграть 1.000.000.000 в казино"
    },
    "🧙‍♀️": {
      name: "Вместе - Сила!",
      description: "Создать/войти в клан"
    },
    "🔑": {
      name: "Добро пожаловать",
      description: "Использовать команду invite"
    },
    "💑": {
      name: "Вместе навсегда",
      description: "Найти себе партнера"
    },
    "🤬": {
      name: "Замолчи!",
      description: "Запретить пользователю писать сообщения"
    },
    "👼": {
      name: "Щедрая душа ",
      description: "Передать 1.000.000 другому пользователю"
    },
    "⁉️": {
      name: "Лагает?",
      description: "Использовать пинг"
    },
    "⚜️": {
      name: "Нарушитель!",
      description: "Отправить жалобу на пользователя"
    },
    "😳": {
      name: "Чтоп сто?",
      description: "Посмотреть на трапов"
    },
    "⏩": {
      name: "Фигня",
      description: "Пропустить песню"
    },
    "👷": {
      name: "Работяга",
      description: "Поработать на работе"
    }
  }
};